       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO INPUTDD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8) VALUE 'SUB00001'.
       PROCEDURE DIVISION.
           DISPLAY 'FIM'.
           MOVE 'SUB00002' TO WS-PGM.
           CALL WS-PGM.
           EXEC CICS LINK PROGRAM(WS-PGM) END-EXEC.
           EXEC CICS XCTL PROGRAM('SUB00003') END-EXEC.
           EXEC SQL INCLUDE SQLCA END-EXEC.
           EXEC SQL
             SELECT * FROM CAD.CLIENTE A JOIN CAD.CONTA B
             ON A.ID = B.ID
           END-EXEC.
           GOBACK.
