       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO.
       AUTHOR.
           COPY FAKECPY. CALL 'NOISE'.
       DATA DIVISION.
           COPY REALCPY.
